{"id":3885,"date":"2020-10-07T16:02:38","date_gmt":"2020-10-07T22:02:38","guid":{"rendered":"https:\/\/cliowebsites.com\/?p=3885"},"modified":"2021-01-22T11:02:09","modified_gmt":"2021-01-22T18:02:09","slug":"do-it-yourself-web-design-for-small-businesses","status":"publish","type":"post","link":"https:\/\/cliowebsites.com\/do-it-yourself-web-design-for-small-businesses\/","title":{"rendered":"Do It Yourself Web Design For Small Businesses"},"content":{"rendered":"\n<p>If you are a small business that can&#8217;t afford to hire a professional web design firm, we have good news. You can get a website launched on your own. Read on for some do it yourself web design tips.<\/p>\n\n\n\n<h2>Do It Yourself Web Design Introduction<\/h2>\n\n\n\n<p>Small businesses don’t have the luxury of supporting a full-sized web design team, but that doesn’t mean they don’t need an awesome website. Fortunately, modern technology makes it easy for small business owners to create stunning websites that show off their brand without any existing technical knowledge or coding experience. With the right tools, you can easily create a beautiful do it yourself website to show off your small business! <\/p>\n\n\n\n<p>In this article, we will show you how to complete your small business web design project. <\/p>\n\n\n\n<p>If you need help, <a href=\"https:\/\/cliowebsites.com\/contact-us\/\">contact Clio Websites<\/a>. We can assist you no matter where you are in your journey.<\/p>\n\n\n\n<div class=\"wp-block-media-text alignwide has-media-on-the-right is-stacked-on-mobile\" style=\"grid-template-columns:auto 35%\"><figure class=\"wp-block-media-text__media\"><img loading=\"lazy\" width=\"480\" height=\"600\" src=\"https:\/\/cliowebsites.com\/wp-content\/uploads\/2020\/10\/clio-websites-do-it-yourself-web-design-for-small-businesses-brand-sneaker.jpg\" alt=\"clio-websites-do-it-yourself-web-design-for-small-businesses-brand-sneaker\" class=\"wp-image-3888\" srcset=\"https:\/\/cliowebsites.com\/wp-content\/uploads\/2020\/10\/clio-websites-do-it-yourself-web-design-for-small-businesses-brand-sneaker.jpg 480w, https:\/\/cliowebsites.com\/wp-content\/uploads\/2020\/10\/clio-websites-do-it-yourself-web-design-for-small-businesses-brand-sneaker-240x300.jpg 240w\" sizes=\"(max-width: 480px) 100vw, 480px\" \/><\/figure><div class=\"wp-block-media-text__content\">\n<div class=\"wp-block-group has-background\" style=\"background:linear-gradient(135deg,rgb(238,238,238) 0%,rgb(204,211,216) 100%)\"><div class=\"wp-block-group__inner-container\">\n<h2>Create Your Brand<\/h2>\n\n\n\n<p>Having your branding developed is the first step in creating a perfect do it yourself website. If you’re not sure where to start, stick with the basics: deciding on a color scheme and a logo. Finding a good color scheme is important to ensure that your business looks appropriate for the industry. Look at the color schemes of other businesses in your niche and see what you can learn.&nbsp;<\/p>\n\n\n\n<p>Having a great logo has never been easier. With helpful tools like <a href=\"http:\/\/canva.com\/\">Canva<\/a>, you can create the perfect logo in no time. Their easy to use templates can make anyone a master of design with no experience needed. Simply choose a good template, add the necessary information, and incorporate your brand colors. You can also hire someone on <a href=\"https:\/\/fiverr.com\">Fiverr <\/a>to create a great logo for your business.<\/p>\n<\/div><\/div>\n<\/div><\/div>\n\n\n\n<p><\/p>\n\n\n\n<h2>Find A Good Website Builder for your Do It Yourself Web Design Project<\/h2>\n\n\n\n<p>After you have settled on your branding preferences, it is time to actually build your website. Website builders are tools designed specifically to help people with no coding experience create websites. Instead of forcing you to use code, you can simply choose a theme or, in some cases, widgets to easily build your website. Everything is already coded, so all you have to do is choose a good layout and then add your content. It’s easy and anyone can make a beautiful web design in no time.<\/p>\n\n\n\n<p>Every website builder has something different to offer. While some focus on keeping design easy or open to different styles, others are more limited and dedicated to creating very nice basic websites. Some builders have more features than others, which is why it is important to look around and determine which one has the right features that suit your needs. Some people prefer simple websites while others need something a little more technical. Fortunately, there are plenty of options to choose from.<\/p>\n\n\n\n<p>Here are some popular website builders that you can try:<\/p>\n\n\n\n<ul><li>WordPress.com<\/li><li>Squarespace<\/li><li>Wix<\/li><li>Weebly<\/li><\/ul>\n\n\n\n<h3>WordPress<\/h3>\n\n\n\n<p>At Clio, we love WordPress and use it for a lot of projects. It enables businesses to get started quickly and launch a website in no time but it&#8217;s unfair to call it a web builder since it offers so much more functionality.&nbsp;<\/p>\n\n\n\n<p>There are a lot of benefits of using WordPress for your do it yourself small business website. The WordPress platform is flexible, expandable, and has lots of online learning resources. It offers lots of functionality such as e-commerce, blogging, as well as complex forms and applications.&nbsp;<\/p>\n\n\n\n<p>One of the drawbacks of WordPress is that it can get complex and overwhelming. If you get stuck and need help, you can check out our <a href=\"https:\/\/cliowebsites.com\/wordpress-developer-calgary\/\">maintenance plans<\/a>, or <a href=\"https:\/\/cliowebsites.com\/contact-us\">contact us<\/a>.<\/p>\n\n\n\n<h3>Squarespace<\/h3>\n\n\n\n<p>Squarespace is another popular web builder that offers a ton of resources and themes to choose from. It’s easy to get started and this platform also offers e-commerce features. The drawback of using Squarespace is being restricted by a lack of functionality and the inability to customize the website.<\/p>\n\n\n\n<h3>Wix<\/h3>\n\n\n\n<p>Wix offers over 500 templates to help you create your first website. It’s easy to use and you can get a website launched in no time. Some of the restrictions and drawbacks include:&nbsp;<\/p>\n\n\n\n<ul><li>Not having the flexibility to customize your website<\/li><li>Inability to grow beyond a simple \/ informational website<\/li><\/ul>\n\n\n\n<h3>Weebly<\/h3>\n\n\n\n<p>Weebly offers the flexibility to get started quickly and also integrate e-commerce functionality. Similar to the other platforms mentioned above, this platform will restrict your growth and ability to customize as you grow.&nbsp;<\/p>\n\n\n\n<h2>Browse Available Themes<\/h2>\n\n\n\n<p>Themes are what makes website builders really pop. In the website building world, a theme is a custom website layout that has already been created for you by a professional. This is what gives you the ability to have a beautiful and professional looking website without actually hiring a design team to build one for you.<\/p>\n\n\n\n<p>Website themes come in all shapes and sizes, making it fairly easy for you to find one that you like. Different styles can help you organize information better, show off a portfolio, or even give you the ability to run a blog for SEO purposes. They make it easy for you to begin filling your website with great content immediately. In most cases, you can change your theme at any point if you find a new one that matches your tastes better.<\/p>\n\n\n\n<div class=\"wp-block-media-text alignwide is-stacked-on-mobile\" style=\"grid-template-columns:47% auto\"><figure class=\"wp-block-media-text__media\"><img loading=\"lazy\" width=\"600\" height=\"407\" src=\"https:\/\/cliowebsites.com\/wp-content\/uploads\/2020\/05\/clio-websites-web-design-for-photographers-clean-photography.jpg\" alt=\"clio-websites-web-design-for-photographers-clean-photography\" class=\"wp-image-3022 size-full\" srcset=\"https:\/\/cliowebsites.com\/wp-content\/uploads\/2020\/05\/clio-websites-web-design-for-photographers-clean-photography.jpg 600w, https:\/\/cliowebsites.com\/wp-content\/uploads\/2020\/05\/clio-websites-web-design-for-photographers-clean-photography-300x204.jpg 300w, https:\/\/cliowebsites.com\/wp-content\/uploads\/2020\/05\/clio-websites-web-design-for-photographers-clean-photography-560x380.jpg 560w\" sizes=\"(max-width: 600px) 100vw, 600px\" \/><\/figure><div class=\"wp-block-media-text__content\">\n<div class=\"wp-block-group has-background\" style=\"background:linear-gradient(320deg,rgb(238,238,238) 0%,rgb(169,184,195) 100%)\"><div class=\"wp-block-group__inner-container\">\n<h2>Add Good Images and Content to Your Do It Yourself Web Design<\/h2>\n\n\n\n<p>When designing your do it yourself website, it’s important to create great content. Once you’ve finished choosing a theme and modifying the sections to suit your needs, it is time to get to work and start filling it with content. Even the most professional template won’t help you if you don’t have good content.<\/p>\n\n\n\n<p>In order to choose the right images and web content, you will need to define your brand identity. This will be focused on how you want to present your business. You might want to come off as fun, professional, family-friendly, or relatable. Decide how you want your audience to see you and choose pictures and written content that match. If you’re not sure where to start, the internet is full of resources on how to find free images, write good content, or even create fun marketing materials.<\/p>\n<\/div><\/div>\n<\/div><\/div>\n\n\n\n<h2>Do It Yourself Web Design for Small Businesses Conclusion<\/h2>\n\n\n\n<p>Small businesses might be small, but they still need to have great websites. Take some time to research and find what materials and tools are available to help you show off your brand in style. Your customers will love seeing a website presented professionally that you took the time to design. <\/p>\n\n\n\n<p>If you are looking for something more unique that will lead to better results and conversion, <a href=\"https:\/\/cliowebsites.com\/contact-us\">contact a marketing agency<\/a> to learn what we can do for you! <\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><img loading=\"lazy\" width=\"1024\" height=\"370\" src=\"https:\/\/cliowebsites.com\/wp-content\/uploads\/2020\/03\/calgary-skyline-picture-clio-websites-wordpress-web-design-calgary-1024x370.jpg\" alt=\"calgary-skyline-picture-clio-websites-wordpress-web-design-calgary\" class=\"wp-image-2544\" srcset=\"https:\/\/cliowebsites.com\/wp-content\/uploads\/2020\/03\/calgary-skyline-picture-clio-websites-wordpress-web-design-calgary-1024x370.jpg 1024w, https:\/\/cliowebsites.com\/wp-content\/uploads\/2020\/03\/calgary-skyline-picture-clio-websites-wordpress-web-design-calgary-300x108.jpg 300w, https:\/\/cliowebsites.com\/wp-content\/uploads\/2020\/03\/calgary-skyline-picture-clio-websites-wordpress-web-design-calgary-768x277.jpg 768w, https:\/\/cliowebsites.com\/wp-content\/uploads\/2020\/03\/calgary-skyline-picture-clio-websites-wordpress-web-design-calgary-1536x555.jpg 1536w, https:\/\/cliowebsites.com\/wp-content\/uploads\/2020\/03\/calgary-skyline-picture-clio-websites-wordpress-web-design-calgary.jpg 1900w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure><\/div>\n\n\n\n<h2>Why Clio<\/h2>\n\n\n\n<p><a href=\"https:\/\/cliowebsites.com\/about-clio-websites\/\">Clio Websites<\/a> is a full-service website design company in Calgary. We have vast experience in responsive website design, website maintenance, WordPress development and support, and online marketing. Clio offers free consultations and <a href=\"https:\/\/cliowebsites.com\/free-website-evaluation\/\">free website evaluations<\/a>. We are always available and happy to answer any questions you may have, so please contact us to find out more. <\/p>\n\n\n\n<p>Clio offers interest-free payment plans and we receive glowing reviews from our clients. Here are a few things that set us apart from the competition. Clio Websites:<\/p>\n\n\n\n<ul><li>Is a premier Calgary web design company with WordPress expertise<\/li><li>Has years of experience helping small businesses achieve their online goals<\/li><li>Has very high customer satisfaction and retention rates (over 98%)<\/li><li>Spends the time to understand your business needs and requirements<\/li><li>Prides ourselves on the quality of service we provide to each and every client<\/li><li>Is responsive and won’t leave you hanging for days when you need support the most<\/li><li>Creates custom websites for each project to separate you from your competition<\/li><\/ul>\n\n\n\n<h2>Do It Yourself Web Design FAQs<\/h2>\n\n\n<div class=\"saswp-faq-block-section\"><ol ><li><strong class=\"saswp-faq-question-title\">How much does it cost to design website?<\/strong><p class=\"saswp-faq-answer-text\">How much does a website cost is the most common question clients ask. The cost usually depends on the web design project requirements. Check out our <a href=\"https:\/\/cliowebsites.com\/web-design-costs-in-calgary\/\">web design costs article<\/a> to find out more. You can <a href=\"https:\/\/cliowebsites.com\/contact-us\/\">contact us<\/a> if you need a detailed quote.<\/p><\/li><li><strong class=\"saswp-faq-question-title\">How much does a website cost per month?<\/strong><p class=\"saswp-faq-answer-text\">Website monthly costs will vary based on the solution and platform that you choose for your do it yourself web design project. In order to launch a website, you will need a domain name and web hosting. Depending on the hosting plan that you choose, you can pay as little as $80\/year. <a href=\"https:\/\/cliowebsites.com\/wordpress-and-bootstrap-website-startup-costs\/\">In this article<\/a>, we talk about all of the costs to launch a website.<\/p><\/li><li><strong class=\"saswp-faq-question-title\">What is the best web design software for beginners?<\/strong><p class=\"saswp-faq-answer-text\">A lot of the do it yourself website builders are easy to use and intuitive. The best web design software is the one that you can use to create a website easily that will allow you to generate leads and sales for your business as quickly as possible. Our recommended do it yourself software includes WordPress, Wix, and Squarespace. <\/p><\/li><li><strong class=\"saswp-faq-question-title\">Is it easy to design a website?<\/strong><p class=\"saswp-faq-answer-text\">Create a modern and professional looking website has never been easier. Using a do it yourself web builder can lead to great results. Adding more complex features like e-commerce capabilities adds complexity and is a bit more difficult. If you need help designing and launching your website, <a href=\"https:\/\/cliowebsites.com\/contact-us\/\">Clio is just a click away<\/a>.<\/p><\/li><li><strong class=\"saswp-faq-question-title\">Where can I make a website for free?<\/strong><p class=\"saswp-faq-answer-text\">It has never been easier to create a free website your clients will love. Our favorite options for creating a free website are WordPress.com, Wix, and Squarespace. Please note that these providers will encourage you to upgrade to a paid plan in order to use some advanced features. <\/p><\/li><li><strong class=\"saswp-faq-question-title\">Is GoDaddy or Shopify better?<\/strong><p class=\"saswp-faq-answer-text\">We don&#039;t recommend using GoDaddy for your web design project. We have helped many clients migrate from GoDaddy due to performance and unfair costs pushed down to clients. Shopify is a much better option for creating a robust and reliable e-commerce website. <\/p><\/li><li><strong class=\"saswp-faq-question-title\">How do I create a website without a host?<\/strong><p class=\"saswp-faq-answer-text\">Creating a website using a do it yourself website builders like Wix and WordPress.com does not require a hosting provider. These platforms will host your website project for free. In order to take advantage of advanced features and a custom domain name (your own address), you will need to upgrade to a paid plan. If your business is looking to launch a custom website to make you stand out from the competition, hosting will be required. <a href=\"https:\/\/cliowebsites.com\/wordpress-and-bootstrap-website-startup-costs\/\">Read this article<\/a> for more information regarding what you will need to get started.<\/p><\/li><li><strong class=\"saswp-faq-question-title\">Is Wix actually free?<\/strong><p class=\"saswp-faq-answer-text\">Both Wix.com and WordPress.com are free platforms that you can use to build your website and get started. In order to utilize more advanced features, a paid option will be required. You don&#039;t need the paid version in order to launch your website on Wix, however. <\/p><\/li><\/ol><\/div>","protected":false},"excerpt":{"rendered":"<p>In this article, we will teach you how to create your small business do it yourself web design project to showcase your brand. <\/p>\n","protected":false},"author":1,"featured_media":3886,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[110,14],"tags":[115,116,18],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.0 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Do It Yourself Web Design For Small Businesses - Clio Websites<\/title>\n<meta name=\"description\" content=\"In this article, we will teach you how to create your small business do it yourself web design project to showcase your brand.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/cliowebsites.com\/do-it-yourself-web-design-for-small-businesses\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Do It Yourself Web Design For Small Businesses - Clio Websites\" \/>\n<meta property=\"og:description\" content=\"In this article, we will teach you how to create your small business do it yourself web design project to showcase your brand.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/cliowebsites.com\/do-it-yourself-web-design-for-small-businesses\/\" \/>\n<meta property=\"og:site_name\" content=\"Clio Websites\" \/>\n<meta property=\"article:published_time\" content=\"2020-10-07T22:02:38+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-22T18:02:09+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/cliowebsites.com\/wp-content\/uploads\/2020\/10\/clio-websites-do-it-yourself-web-design-for-small-businesses-header.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1900\" \/>\n\t<meta property=\"og:image:height\" content=\"925\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@natmiletic\" \/>\n<meta name=\"twitter:site\" content=\"@natmiletic\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"nmiletic\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"6 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Do It Yourself Web Design For Small Businesses - Clio Websites","description":"In this article, we will teach you how to create your small business do it yourself web design project to showcase your brand.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/cliowebsites.com\/do-it-yourself-web-design-for-small-businesses\/","og_locale":"en_US","og_type":"article","og_title":"Do It Yourself Web Design For Small Businesses - Clio Websites","og_description":"In this article, we will teach you how to create your small business do it yourself web design project to showcase your brand.","og_url":"https:\/\/cliowebsites.com\/do-it-yourself-web-design-for-small-businesses\/","og_site_name":"Clio Websites","article_published_time":"2020-10-07T22:02:38+00:00","article_modified_time":"2021-01-22T18:02:09+00:00","og_image":[{"width":1900,"height":925,"url":"https:\/\/cliowebsites.com\/wp-content\/uploads\/2020\/10\/clio-websites-do-it-yourself-web-design-for-small-businesses-header.jpg","path":"\/var\/www\/vhosts\/cliowebsites.com\/httpdocs\/wp-content\/uploads\/2020\/10\/clio-websites-do-it-yourself-web-design-for-small-businesses-header.jpg","size":"full","id":3886,"alt":"clio-websites-do-it-yourself-web-design-for-small-businesses-header","pixels":1757500,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@natmiletic","twitter_site":"@natmiletic","twitter_misc":{"Written by":"nmiletic","Est. reading time":"6 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/cliowebsites.com\/#organization","name":"Clio Websites","url":"https:\/\/cliowebsites.com\/","sameAs":["https:\/\/www.linkedin.com\/company\/clio-data-solutions\/","https:\/\/twitter.com\/natmiletic"],"logo":{"@type":"ImageObject","@id":"https:\/\/cliowebsites.com\/#logo","inLanguage":"en-US","url":"https:\/\/cliowebsites.com\/wp-content\/uploads\/2020\/02\/newlogo-dark.png","contentUrl":"https:\/\/cliowebsites.com\/wp-content\/uploads\/2020\/02\/newlogo-dark.png","width":1000,"height":272,"caption":"Clio Websites"},"image":{"@id":"https:\/\/cliowebsites.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/cliowebsites.com\/#website","url":"https:\/\/cliowebsites.com\/","name":"Clio Websites","description":"Calgary Web Design and WordPress Company","publisher":{"@id":"https:\/\/cliowebsites.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/cliowebsites.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/cliowebsites.com\/do-it-yourself-web-design-for-small-businesses\/#primaryimage","inLanguage":"en-US","url":"https:\/\/cliowebsites.com\/wp-content\/uploads\/2020\/10\/clio-websites-do-it-yourself-web-design-for-small-businesses-header.jpg","contentUrl":"https:\/\/cliowebsites.com\/wp-content\/uploads\/2020\/10\/clio-websites-do-it-yourself-web-design-for-small-businesses-header.jpg","width":1900,"height":925,"caption":"clio-websites-do-it-yourself-web-design-for-small-businesses-header"},{"@type":"WebPage","@id":"https:\/\/cliowebsites.com\/do-it-yourself-web-design-for-small-businesses\/#webpage","url":"https:\/\/cliowebsites.com\/do-it-yourself-web-design-for-small-businesses\/","name":"Do It Yourself Web Design For Small Businesses - Clio Websites","isPartOf":{"@id":"https:\/\/cliowebsites.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/cliowebsites.com\/do-it-yourself-web-design-for-small-businesses\/#primaryimage"},"datePublished":"2020-10-07T22:02:38+00:00","dateModified":"2021-01-22T18:02:09+00:00","description":"In this article, we will teach you how to create your small business do it yourself web design project to showcase your brand.","breadcrumb":{"@id":"https:\/\/cliowebsites.com\/do-it-yourself-web-design-for-small-businesses\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/cliowebsites.com\/do-it-yourself-web-design-for-small-businesses\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/cliowebsites.com\/do-it-yourself-web-design-for-small-businesses\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/cliowebsites.com\/"},{"@type":"ListItem","position":2,"name":"Do It Yourself Web Design For Small Businesses"}]},{"@type":"Article","@id":"https:\/\/cliowebsites.com\/do-it-yourself-web-design-for-small-businesses\/#article","isPartOf":{"@id":"https:\/\/cliowebsites.com\/do-it-yourself-web-design-for-small-businesses\/#webpage"},"author":{"@id":"https:\/\/cliowebsites.com\/#\/schema\/person\/87b5aa39dae76c31120b3053134e8a5e"},"headline":"Do It Yourself Web Design For Small Businesses","datePublished":"2020-10-07T22:02:38+00:00","dateModified":"2021-01-22T18:02:09+00:00","mainEntityOfPage":{"@id":"https:\/\/cliowebsites.com\/do-it-yourself-web-design-for-small-businesses\/#webpage"},"wordCount":1170,"commentCount":0,"publisher":{"@id":"https:\/\/cliowebsites.com\/#organization"},"image":{"@id":"https:\/\/cliowebsites.com\/do-it-yourself-web-design-for-small-businesses\/#primaryimage"},"thumbnailUrl":"https:\/\/cliowebsites.com\/wp-content\/uploads\/2020\/10\/clio-websites-do-it-yourself-web-design-for-small-businesses-header.jpg","keywords":["Brand","Marketing","Web Design"],"articleSection":["Marketing","Web Design"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/cliowebsites.com\/do-it-yourself-web-design-for-small-businesses\/#respond"]}]},{"@type":"Person","@id":"https:\/\/cliowebsites.com\/#\/schema\/person\/87b5aa39dae76c31120b3053134e8a5e","name":"nmiletic","image":{"@type":"ImageObject","@id":"https:\/\/cliowebsites.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/cliowebsites.com\/wp-content\/litespeed\/avatar\/de268487f74af8f7a77e83360d5445b2.jpg","contentUrl":"https:\/\/cliowebsites.com\/wp-content\/litespeed\/avatar\/de268487f74af8f7a77e83360d5445b2.jpg","caption":"nmiletic"},"description":"Nat Miletic - Founder of Clio Websites (Clio Data Solutions Ltd.). Passionate about helping small businesses implement beautiful, responsive and functional websites and WordPress systems.","sameAs":["https:\/\/cliowebsites.com","https:\/\/twitter.com\/natmiletic"]}]}},"_links":{"self":[{"href":"https:\/\/cliowebsites.com\/wp-json\/wp\/v2\/posts\/3885"}],"collection":[{"href":"https:\/\/cliowebsites.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/cliowebsites.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/cliowebsites.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/cliowebsites.com\/wp-json\/wp\/v2\/comments?post=3885"}],"version-history":[{"count":0,"href":"https:\/\/cliowebsites.com\/wp-json\/wp\/v2\/posts\/3885\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/cliowebsites.com\/wp-json\/wp\/v2\/media\/3886"}],"wp:attachment":[{"href":"https:\/\/cliowebsites.com\/wp-json\/wp\/v2\/media?parent=3885"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/cliowebsites.com\/wp-json\/wp\/v2\/categories?post=3885"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/cliowebsites.com\/wp-json\/wp\/v2\/tags?post=3885"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}